{
    "showProgress": true,
    "showStepNumbers": true,
    "steps": [
        {
            "title": "Listado de ítems",
            "intro": "Esta pantalla muestra todos los ítems de la colección digital del centro. Desde aquí puedes navegar, buscar, ordenar y gestionar en lote los recursos creados por el profesorado o el alumnado.",
            "position": "bottom"
        },
        {
            "element": "h1 .title",
            "title": "Título de la vista",
            "intro": "El título de la página indica que estás en el listado general de ítems del repositorio.",
            "position": "bottom"
        },
        {
            "element": ".browse-controls .pagination",
            "title": "Navegación entre páginas",
            "intro": "Aquí puedes avanzar o retroceder entre páginas de resultados. Esta función es útil cuando existen muchos ítems en la colección.",
            "position": "bottom"
        },
        {
            "element": ".advanced-search",
            "title": "Búsqueda avanzada",
            "intro": "La búsqueda avanzada permite filtrar por propiedades, plantillas, fechas, visibilidad y otros criterios. Muy útil para localizar recursos educativos concretos.",
            "position": "right"
        },
        {
            "element": ".sorting",
            "title": "Ordenación de ítems",
            "intro": "Puedes ordenar los ítems por fecha de creación, ID, propietario, clase de recurso o título. Este control facilita la organización del catálogo.",
            "position": "bottom"
        },
        {
            "element": "#page-actions a.button",
            "title": "Añadir nuevo ítem",
            "intro": "Este botón te permite crear un nuevo ítem. Un ítem puede contener imágenes, documentos, vídeos, audios u otros materiales educativos. Al hacer clic se abrirá el formulario de creación.",
            "position": "left"
        },
        {
            "element": ".batch-inputs",
            "title": "Acciones en lote",
            "intro": "Puedes aplicar acciones en lote, como editar o eliminar varios ítems a la vez. Esta herramienta agiliza la gestión de grandes colecciones escolares.",
            "position": "bottom"
        },
        {
            "element": "table.tablesaw",
            "title": "Tabla de ítems",
            "intro": "Aquí aparece la lista de ítems. Cada fila representa un recurso individual. Incluye miniaturas, título, propietario y fecha de creación.",
            "position": "top"
        },
        {
            "element": "table.tablesaw tbody tr:first-child .resource-link",
            "title": "Acceso al ítem",
            "intro": "Haz clic sobre el título o la miniatura para ver la ficha completa del ítem, su descripción y sus metadatos.",
            "position": "right"
        },
        {
            "element": "table.tablesaw tbody tr:first-child ul.actions",
            "title": "Opciones del ítem",
            "intro": "Desde aquí puedes editar el ítem, consultar sus detalles o eliminarlo. Estas acciones solo afectan al ítem seleccionado.",
            "position": "left"
        },
        {
            "title": "Fin del recorrido",
            "intro": "Este es el final del tour por el listado de ítems. Puedes continuar explorando las opciones del sistema o iniciar otro recorrido desde el botón de ayuda.",
            "position": "bottom"
        }
    ]
}